RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW20Z4/include/MKW20Z4_extension.h
/*******************************************************************************
 * XCVR_TX_DIG_CTRL - TX Digital Control
 ******************************************************************************/

/*!
 * @brief XCVR_TX_DIG_CTRL - TX Digital Control (RW)
 *
 * Reset value: 0x00000140U
 */
/*!
 * @name Constants and macros for entire XCVR_TX_DIG_CTRL register
 */
/*@{*/
#define XCVR_RD_TX_DIG_CTRL(base) (XCVR_TX_DIG_CTRL_REG(base))
#define XCVR_WR_TX_DIG_CTRL(base, value) (XCVR_TX_DIG_CTRL_REG(base) = (value))
#define XCVR_RMW_TX_DIG_CTRL(base, mask, value) (XCVR_WR_TX_DIG_CTRL(base, (XCVR_RD_TX_DIG_CTRL(base) & ~(mask)) | (value)))
#define XCVR_SET_TX_DIG_CTRL(base, value) (BME_OR32(&XCVR_TX_DIG_CTRL_REG(base), (uint32_t)(value)))
#define XCVR_CLR_TX_DIG_CTRL(base, value) (BME_AND32(&XCVR_TX_DIG_CTRL_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_TX_DIG_CTRL(base, value) (BME_XOR32(&XCVR_TX_DIG_CTRL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XCVR_TX_DIG_CTRL bitfields
 */

/*!
 * @name Register XCVR_TX_DIG_CTRL, field DFT_MODE[2:0] (RW)
 *
 * This register selects the Radio DFT mode as described below. In addition to
 * setting the Radio DFT mode, the DFT LFSR needs to be configured, and the Radio
 * Protocol needs to be chosen. Note that the LFSR Symbols mode is not supported
 * for GFSK Protocols, and the Tone modes bypass both the GFSK and the FSK
 * modulators.
 *
 * Values:
 * - 0b000 - Normal Radio Operation. DFT not engaged.
 * - 0b001 - Pattern Register Mode. TX DFT Modulation Pattern Register is
 *     shifted out as the transmission data stream. Note that the DFT_EN bit must be
 *     set.
 * - 0b010 - LFSR Data Mode. TX LFSR is used as the transmission data stream.
 *     Note that the LFSR_EN bit must be set.
 * - 0b011 - LFSR Symbol Mode. TX LFSR is used to create 802.15.4 symbols which
 *     are then converted to Chips and transmitted. Note that the LFSR_EN bit
 *     must be set.
 * - 0b100 - Not implemented on Apache 1.0, future use will allow a package pin
 *     to be used as the source of the TX data stream. Note that the DFT_EN bit
 *     must be set.
 * - 0b101 - Constant Frequency Mode. No data modulation is done, Radio
 *     transmits at the channel frequency selected.
 * - 0b110 - LFSR Tone Mode. TX LFSR is used to select the DFT Tone register to
 *     transmit, LFSR_EN bit must be set.
 * - 0b111 - Manual Tone Mode. TONE_SEL is used to select the DFT Tone register
 *     to transmit.
 */
/*@{*/
/*! @brief Read current value of the XCVR_TX_DIG_CTRL_DFT_MODE field. */
#define XCVR_RD_TX_DIG_CTRL_DFT_MODE(base) ((XCVR_TX_DIG_CTRL_REG(base) & XCVR_TX_DIG_CTRL_DFT_MODE_MASK) >> XCVR_TX_DIG_CTRL_DFT_MODE_SHIFT)
#define XCVR_BRD_TX_DIG_CTRL_DFT_MODE(base) (BME_UBFX32(&XCVR_TX_DIG_CTRL_REG(base), XCVR_TX_DIG_CTRL_DFT_MODE_SHIFT, XCVR_TX_DIG_CTRL_DFT_MODE_WIDTH))

/*! @brief Set the DFT_MODE field to a new value. */
#define XCVR_WR_TX_DIG_CTRL_DFT_MODE(base, value) (XCVR_RMW_TX_DIG_CTRL(base, XCVR_TX_DIG_CTRL_DFT_MODE_MASK, XCVR_TX_DIG_CTRL_DFT_MODE(value)))
#define XCVR_BWR_TX_DIG_CTRL_DFT_MODE(base, value) (BME_BFI32(&XCVR_TX_DIG_CTRL_REG(base), ((uint32_t)(value) << XCVR_TX_DIG_CTRL_DFT_MODE_SHIFT), XCVR_TX_DIG_CTRL_DFT_MODE_SHIFT, XCVR_TX_DIG_CTRL_DFT_MODE_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TX_DIG_CTRL, field DFT_EN[3] (RW)
 *
 * If the Radio is in DFT Pattern Register mode, then this bit is used to turn
 * on and off the modulation.
 */
/*@{*/
/*! @brief Read current value of the XCVR_TX_DIG_CTRL_DFT_EN field. */
#define XCVR_RD_TX_DIG_CTRL_DFT_EN(base) ((XCVR_TX_DIG_CTRL_REG(base) & XCVR_TX_DIG_CTRL_DFT_EN_MASK) >> XCVR_TX_DIG_CTRL_DFT_EN_SHIFT)
#define XCVR_BRD_TX_DIG_CTRL_DFT_EN(base) (BME_UBFX32(&XCVR_TX_DIG_CTRL_REG(base), XCVR_TX_DIG_CTRL_DFT_EN_SHIFT, XCVR_TX_DIG_CTRL_DFT_EN_WIDTH))

/*! @brief Set the DFT_EN field to a new value. */
#define XCVR_WR_TX_DIG_CTRL_DFT_EN(base, value) (XCVR_RMW_TX_DIG_CTRL(base, XCVR_TX_DIG_CTRL_DFT_EN_MASK, XCVR_TX_DIG_CTRL_DFT_EN(value)))
#define XCVR_BWR_TX_DIG_CTRL_DFT_EN(base, value) (BME_BFI32(&XCVR_TX_DIG_CTRL_REG(base), ((uint32_t)(value) << XCVR_TX_DIG_CTRL_DFT_EN_SHIFT), XCVR_TX_DIG_CTRL_DFT_EN_SHIFT, XCVR_TX_DIG_CTRL_DFT_EN_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TX_DIG_CTRL, field DFT_LFSR_LEN[6:4] (RW)
 *
 * This register selects the length of the DFT LFSR and the associated LFSR Tap
 * Mask. The Mask is in the form of [MSB...LSB]
 *
 * Values:
 * - 0b000 - LFSR 9, tap mask 100010000
 * - 0b001 - LFSR 10, tap mask 1001000000
 * - 0b010 - LFSR 11, tap mask 11101000000
 * - 0b011 - LFSR 13, tap mask 1101100000000
 * - 0b100 - LFSR 15, tap mask 111010000000000
 * - 0b101 - LFSR 17, tap mask 11110000000000000
 * - 0b110 - Reserved
 * - 0b111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the XCVR_TX_DIG_CTRL_DFT_LFSR_LEN field. */
#define XCVR_RD_TX_DIG_CTRL_DFT_LFSR_LEN(base) ((XCVR_TX_DIG_CTRL_REG(base) & XCVR_TX_DIG_CTRL_DFT_LFSR_LEN_MASK) >> XCVR_TX_DIG_CTRL_DFT_LFSR_LEN_SHIFT)
#define XCVR_BRD_TX_DIG_CTRL_DFT_LFSR_LEN(base) (BME_UBFX32(&XCVR_TX_DIG_CTRL_REG(base), XCVR_TX_DIG_CTRL_DFT_LFSR_LEN_SHIFT, XCVR_TX_DIG_CTRL_DFT_LFSR_LEN_WIDTH))

/*! @brief Set the DFT_LFSR_LEN field to a new value. */
#define XCVR_WR_TX_DIG_CTRL_DFT_LFSR_LEN(base, value) (XCVR_RMW_TX_DIG_CTRL(base, XCVR_TX_DIG_CTRL_DFT_LFSR_LEN_MASK, XCVR_TX_DIG_CTRL_DFT_LFSR_LEN(value)))
#define XCVR_BWR_TX_DIG_CTRL_DFT_LFSR_LEN(base, value) (BME_BFI32(&XCVR_TX_DIG_CTRL_REG(base), ((uint32_t)(value) << XCVR_TX_DIG_CTRL_DFT_LFSR_LEN_SHIFT), XCVR_TX_DIG_CTRL_DFT_LFSR_LEN_SHIFT, XCVR_TX_DIG_CTRL_DFT_LFSR_LEN_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TX_DIG_CTRL, field LFSR_EN[7] (RW)
 *
 * This bit enables the DFT LFSR for use as a source for Data Padding and TX
 * Data in LFSR Data mode, for use as TX Symbols in LFSR Symbol mode, and for use as
 * the Tone Selector in LFSR Tone mode. Effectively this is the on-off switch
 * for modulation in these modes. Note that the LFSR is clocked at the DFT Clock
 * frequency.
 */
/*@{*/
/*! @brief Read current value of the XCVR_TX_DIG_CTRL_LFSR_EN field. */
#define XCVR_RD_TX_DIG_CTRL_LFSR_EN(base) ((XCVR_TX_DIG_CTRL_REG(base) & XCVR_TX_DIG_CTRL_LFSR_EN_MASK) >> XCVR_TX_DIG_CTRL_LFSR_EN_SHIFT)
#define XCVR_BRD_TX_DIG_CTRL_LFSR_EN(base) (BME_UBFX32(&XCVR_TX_DIG_CTRL_REG(base), XCVR_TX_DIG_CTRL_LFSR_EN_SHIFT, XCVR_TX_DIG_CTRL_LFSR_EN_WIDTH))

/*! @brief Set the LFSR_EN field to a new value. */
#define XCVR_WR_TX_DIG_CTRL_LFSR_EN(base, value) (XCVR_RMW_TX_DIG_CTRL(base, XCVR_TX_DIG_CTRL_LFSR_EN_MASK, XCVR_TX_DIG_CTRL_LFSR_EN(value)))
#define XCVR_BWR_TX_DIG_CTRL_LFSR_EN(base, value) (BME_BFI32(&XCVR_TX_DIG_CTRL_REG(base), ((uint32_t)(value) << XCVR_TX_DIG_CTRL_LFSR_EN_SHIFT), XCVR_TX_DIG_CTRL_LFSR_EN_SHIFT, XCVR_TX_DIG_CTRL_LFSR_EN_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TX_DIG_CTRL, field DFT_CLK_SEL[10:8] (RW)
 *
 * This register selects the frequency of the DFT clock that is used to shift
 * out the DFT Modulation Pattern and also used to clock the LFSR in DFT LFSR modes.
 *
 * Values:
 * - 0b000 - 62.5 kHz
 * - 0b001 - 125 kHz
 * - 0b010 - 250 kHz
 * - 0b011 - 500 kHz
 * - 0b100 - 1 MHz
 * - 0b101 - 2 MHz
 * - 0b110 - 4 MHz
 * - 0b111 - Clock is off
 */
/*@{*/
/*! @brief Read current value of the XCVR_TX_DIG_CTRL_DFT_CLK_SEL field. */
#define XCVR_RD_TX_DIG_CTRL_DFT_CLK_SEL(base) ((XCVR_TX_DIG_CTRL_REG(base) & XCVR_TX_DIG_CTRL_DFT_CLK_SEL_MASK) >> XCVR_TX_DIG_CTRL_DFT_CLK_SEL_SHIFT)
#define XCVR_BRD_TX_DIG_CTRL_DFT_CLK_SEL(base) (BME_UBFX32(&XCVR_TX_DIG_CTRL_REG(base), XCVR_TX_DIG_CTRL_DFT_CLK_SEL_SHIFT, XCVR_TX_DIG_CTRL_DFT_CLK_SEL_WIDTH))

/*! @brief Set the DFT_CLK_SEL field to a new value. */
#define XCVR_WR_TX_DIG_CTRL_DFT_CLK_SEL(base, value) (XCVR_RMW_TX_DIG_CTRL(base, XCVR_TX_DIG_CTRL_DFT_CLK_SEL_MASK, XCVR_TX_DIG_CTRL_DFT_CLK_SEL(value)))
#define XCVR_BWR_TX_DIG_CTRL_DFT_CLK_SEL(base, value) (BME_BFI32(&XCVR_TX_DIG_CTRL_REG(base), ((uint32_t)(value) << XCVR_TX_DIG_CTRL_DFT_CLK_SEL_SHIFT), XCVR_TX_DIG_CTRL_DFT_CLK_SEL_SHIFT, XCVR_TX_DIG_CTRL_DFT_CLK_SEL_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TX_DIG_CTRL, field TONE_SEL[13:12] (RW)
 *
 * This register selects the DFT Tone register to use as the Modulation Source
 * in DFT Manual Tone mode. The selected Tone will be added as a constant
 * frequency offset to the current Radio frequency. Software can change the tone
 * selection to modulate the Radio frequency at a software derived frequency. Note that
 * the DFT LFSR Tone mode can be used to randomly modulate with tones at the DFT
 * Clock frequency.
 *
 * Values:
 * - 0b00 - DFT Tone 0
 * - 0b01 - DFT Tone 1
 * - 0b10 - DFT Tone 2
 * - 0b11 - DFT Tone 3
 */
/*@{*/
/*! @brief Read current value of the XCVR_TX_DIG_CTRL_TONE_SEL field. */
#define XCVR_RD_TX_DIG_CTRL_TONE_SEL(base) ((XCVR_TX_DIG_CTRL_REG(base) & XCVR_TX_DIG_CTRL_TONE_SEL_MASK) >> XCVR_TX_DIG_CTRL_TONE_SEL_SHIFT)
#define XCVR_BRD_TX_DIG_CTRL_TONE_SEL(base) (BME_UBFX32(&XCVR_TX_DIG_CTRL_REG(base), XCVR_TX_DIG_CTRL_TONE_SEL_SHIFT, XCVR_TX_DIG_CTRL_TONE_SEL_WIDTH))

/*! @brief Set the TONE_SEL field to a new value. */
#define XCVR_WR_TX_DIG_CTRL_TONE_SEL(base, value) (XCVR_RMW_TX_DIG_CTRL(base, XCVR_TX_DIG_CTRL_TONE_SEL_MASK, XCVR_TX_DIG_CTRL_TONE_SEL(value)))
#define XCVR_BWR_TX_DIG_CTRL_TONE_SEL(base, value) (BME_BFI32(&XCVR_TX_DIG_CTRL_REG(base), ((uint32_t)(value) << XCVR_TX_DIG_CTRL_TONE_SEL_SHIFT), XCVR_TX_DIG_CTRL_TONE_SEL_SHIFT, XCVR_TX_DIG_CTRL_TONE_SEL_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TX_DIG_CTRL, field POL[16] (RW)
 *
 * This bit selects between Even or Odd reference clock cycles to sample the TX
 * Modulators output values. The TX Modulator to sample is selected by the Radio
 * Protocol and the Radio DFT Mode, and can be either the GFSK modulator, the FSK
 * modulator, or the DFT Tone modulator. The resulting Oversampled Modulation is
 * the Baseband Frequency Word presented to the PLL
 *
 * Values:
 * - 0b0 - Selects Even clock cycle
 * - 0b1 - Selects Odd clock cycle, a one cycle delay
 */
/*@{*/
/*! @brief Read current value of the XCVR_TX_DIG_CTRL_POL field. */
#define XCVR_RD_TX_DIG_CTRL_POL(base) ((XCVR_TX_DIG_CTRL_REG(base) & XCVR_TX_DIG_CTRL_POL_MASK) >> XCVR_TX_DIG_CTRL_POL_SHIFT)
#define XCVR_BRD_TX_DIG_CTRL_POL(base) (BME_UBFX32(&XCVR_TX_DIG_CTRL_REG(base), XCVR_TX_DIG_CTRL_POL_SHIFT, XCVR_TX_DIG_CTRL_POL_WIDTH))

/*! @brief Set the POL field to a new value. */
#define XCVR_WR_TX_DIG_CTRL_POL(base, value) (XCVR_RMW_TX_DIG_CTRL(base, XCVR_TX_DIG_CTRL_POL_MASK, XCVR_TX_DIG_CTRL_POL(value)))
#define XCVR_BWR_TX_DIG_CTRL_POL(base, value) (BME_BFI32(&XCVR_TX_DIG_CTRL_REG(base), ((uint32_t)(value) << XCVR_TX_DIG_CTRL_POL_SHIFT), XCVR_TX_DIG_CTRL_POL_SHIFT, XCVR_TX_DIG_CTRL_POL_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TX_DIG_CTRL, field DP_SEL[20] (RW)
 *
 * In normal user GSFK modes the BLE link layer overrides this bit to match the
 * first bit of the packet preamble. In Radio Protocol 7, 128 Channel GFSK mode,
 * this register bit is active and selects the 8 bits of data padding. For DFT
 * GFSK modes, this register bit is active and the unselected data padding pattern
 * is added as an additional 8 bits of padding after the selected pattern is
 * shifted out. For 802.15.4 Radio Protocols, this register bit selects the data
 * padding pattern to be used as Symbols and converted to Chips for padding. In all
 * cases the LSB is the first bit shifted out as data padding.
 *
 * Values:
 * - 0b0 - Selects DATA_PADDING_PATTERN_0 as the source for data padding
 * - 0b1 - Selects DATA_PADDING_PATTERN_1 as the source for data padding
 */
/*@{*/
/*! @brief Read current value of the XCVR_TX_DIG_CTRL_DP_SEL field. */
#define XCVR_RD_TX_DIG_CTRL_DP_SEL(base) ((XCVR_TX_DIG_CTRL_REG(base) & XCVR_TX_DIG_CTRL_DP_SEL_MASK) >> XCVR_TX_DIG_CTRL_DP_SEL_SHIFT)
#define XCVR_BRD_TX_DIG_CTRL_DP_SEL(base) (BME_UBFX32(&XCVR_TX_DIG_CTRL_REG(base), XCVR_TX_DIG_CTRL_DP_SEL_SHIFT, XCVR_TX_DIG_CTRL_DP_SEL_WIDTH))

/*! @brief Set the DP_SEL field to a new value. */
#define XCVR_WR_TX_DIG_CTRL_DP_SEL(base, value) (XCVR_RMW_TX_DIG_CTRL(base, XCVR_TX_DIG_CTRL_DP_SEL_MASK, XCVR_TX_DIG_CTRL_DP_SEL(value)))
#define XCVR_BWR_TX_DIG_CTRL_DP_SEL(base, value) (BME_BFI32(&XCVR_TX_DIG_CTRL_REG(base), ((uint32_t)(value) << XCVR_TX_DIG_CTRL_DP_SEL_SHIFT), XCVR_TX_DIG_CTRL_DP_SEL_SHIFT, XCVR_TX_DIG_CTRL_DP_SEL_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TX_DIG_CTRL, field FREQ_WORD_ADJ[31:22] (RW)
 *
 * This register is a signed 9 bit number that is added to the GFSK modulator
 * output. This allows the GFSK modulation to be adjusted, or skewed, by a range of
 * -512 to +511.
 */
/*@{*/
/*! @brief Read current value of the XCVR_TX_DIG_CTRL_FREQ_WORD_ADJ field. */
#define XCVR_RD_TX_DIG_CTRL_FREQ_WORD_ADJ(base) ((XCVR_TX_DIG_CTRL_REG(base) & XCVR_TX_DIG_CTRL_FREQ_WORD_ADJ_MASK) >> XCVR_TX_DIG_CTRL_FREQ_WORD_ADJ_SHIFT)
#define XCVR_BRD_TX_DIG_CTRL_FREQ_WORD_ADJ(base) (BME_UBFX32(&XCVR_TX_DIG_CTRL_REG(base), XCVR_TX_DIG_CTRL_FREQ_WORD_ADJ_SHIFT, XCVR_TX_DIG_CTRL_FREQ_WORD_ADJ_WIDTH))

/*! @brief Set the FREQ_WORD_ADJ field to a new value. */
#define XCVR_WR_TX_DIG_CTRL_FREQ_WORD_ADJ(base, value) (XCVR_RMW_TX_DIG_CTRL(base, XCVR_TX_DIG_CTRL_FREQ_WORD_ADJ_MASK, XCVR_TX_DIG_CTRL_FREQ_WORD_ADJ(value)))
#define XCVR_BWR_TX_DIG_CTRL_FREQ_WORD_ADJ(base, value) (BME_BFI32(&XCVR_TX_DIG_CTRL_REG(base), ((uint32_t)(value) << XCVR_TX_DIG_CTRL_FREQ_WORD_ADJ_SHIFT), XCVR_TX_DIG_CTRL_FREQ_WORD_ADJ_SHIFT, XCVR_TX_DIG_CTRL_FREQ_WORD_ADJ_WIDTH))
/*@}*/

