RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW20Z4/include/MKW20Z4_extension.h
/*! @brief Set the DMA_Q_EN field to a new value. */
#define XCVR_WR_DMA_CTRL_DMA_Q_EN(base, value) (XCVR_RMW_DMA_CTRL(base, XCVR_DMA_CTRL_DMA_Q_EN_MASK, XCVR_DMA_CTRL_DMA_Q_EN(value)))
#define XCVR_BWR_DMA_CTRL_DMA_Q_EN(base, value) (BME_BFI32(&XCVR_DMA_CTRL_REG(base), ((uint32_t)(value) << XCVR_DMA_CTRL_DMA_Q_EN_SHIFT), XCVR_DMA_CTRL_DMA_Q_EN_SHIFT, XCVR_DMA_CTRL_DMA_Q_EN_WIDTH))
/*@}*/

/*******************************************************************************
 * XCVR_DMA_DATA - DMA Data
 ******************************************************************************/

/*!
 * @brief XCVR_DMA_DATA - DMA Data (RO)
 *
 * Reset value: 0x00000000U
 *
 * Transceiver DMA Data. Not intended to be read directly by application
 * software, this register is merely an address slot where the SoC DMA controller can
 * access the RX_DIG samples to be transferred to memory. After enabling
 * transceiver DMA, the first sample pair should be discarded due to DMA controller
 * latency; all subsequent samples are valid
 */
/*!
 * @name Constants and macros for entire XCVR_DMA_DATA register
 */
/*@{*/
#define XCVR_RD_DMA_DATA(base)   (XCVR_DMA_DATA_REG(base))
/*@}*/

/*
 * Constants & macros for individual XCVR_DMA_DATA bitfields
 */

/*!
 * @name Register XCVR_DMA_DATA, field DMA_DATA_11_0[11:0] (RO)
 *
 * Reflection of the RX_DIG DMA data to be stored to system memory. The
 * transceiver DMA engine acquires 12-bit samples from RX_DIG, and deposits them in this
 * register field. If DMA I channel is enabled, i.e. DMA_CTRL[DMA_I_EN]=1, then
 * this register field contains I channel samples; otherwise it contains Q channel
 * samples. For single-channel mode, this register field represents the first
 * consecutive RX_DIG sample of the sample-pair; for dual-channel mode, I and Q
 * samples are captured simultaneously.
 */
/*@{*/
/*! @brief Read current value of the XCVR_DMA_DATA_DMA_DATA_11_0 field. */
#define XCVR_RD_DMA_DATA_DMA_DATA_11_0(base) ((XCVR_DMA_DATA_REG(base) & XCVR_DMA_DATA_DMA_DATA_11_0_MASK) >> XCVR_DMA_DATA_DMA_DATA_11_0_SHIFT)
#define XCVR_BRD_DMA_DATA_DMA_DATA_11_0(base) (BME_UBFX32(&XCVR_DMA_DATA_REG(base), XCVR_DMA_DATA_DMA_DATA_11_0_SHIFT, XCVR_DMA_DATA_DMA_DATA_11_0_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_DMA_DATA, field DMA_DATA_27_16[27:16] (RO)
 *
 * Reflection of the RX_DIG DMA data to be stored to system memory. The
 * transceiver DMA engine acquires 12-bit samples from RX_DIG, and deposits them in this
 * register field. If DMA Q channel is enabled, i.e. DMA_CTRL[DMA_Q_EN]=1, then
 * this register field contains Q channel samples; otherwise it contains I channel
 * samples. For single-channel mode, this register field represents the second
 * consecutive RX_DIG sample of the sample-pair; for dual-channel mode, I and Q
 * samples are captured simultaneously.
 */
/*@{*/
/*! @brief Read current value of the XCVR_DMA_DATA_DMA_DATA_27_16 field. */
#define XCVR_RD_DMA_DATA_DMA_DATA_27_16(base) ((XCVR_DMA_DATA_REG(base) & XCVR_DMA_DATA_DMA_DATA_27_16_MASK) >> XCVR_DMA_DATA_DMA_DATA_27_16_SHIFT)
#define XCVR_BRD_DMA_DATA_DMA_DATA_27_16(base) (BME_UBFX32(&XCVR_DMA_DATA_REG(base), XCVR_DMA_DATA_DMA_DATA_27_16_SHIFT, XCVR_DMA_DATA_DMA_DATA_27_16_WIDTH))
/*@}*/

/*******************************************************************************
 * XCVR_DTEST_CTRL - Digital Test Control
 ******************************************************************************/

/*!
 * @brief XCVR_DTEST_CTRL - Digital Test Control (RW)
 *
 * Reset value: 0x00000000U
 *
 * Digital Test Control. Allows selection and enablement of a page of DTEST
 * signals to appear on the SoC DTEST pins. This register configures only the
 * transceiver for DTEST mode; since DTEST pads on the SoC are multiplexed with other
 * functions, SoC Port Pin programming is also required for each DTEST output
 */
/*!
 * @name Constants and macros for entire XCVR_DTEST_CTRL register
 */
/*@{*/
#define XCVR_RD_DTEST_CTRL(base) (XCVR_DTEST_CTRL_REG(base))
#define XCVR_WR_DTEST_CTRL(base, value) (XCVR_DTEST_CTRL_REG(base) = (value))
#define XCVR_RMW_DTEST_CTRL(base, mask, value) (XCVR_WR_DTEST_CTRL(base, (XCVR_RD_DTEST_CTRL(base) & ~(mask)) | (value)))
#define XCVR_SET_DTEST_CTRL(base, value) (BME_OR32(&XCVR_DTEST_CTRL_REG(base), (uint32_t)(value)))
#define XCVR_CLR_DTEST_CTRL(base, value) (BME_AND32(&XCVR_DTEST_CTRL_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_DTEST_CTRL(base, value) (BME_XOR32(&XCVR_DTEST_CTRL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XCVR_DTEST_CTRL bitfields
 */

/*!
 * @name Register XCVR_DTEST_CTRL, field DTEST_PAGE[5:0] (RW)
 *
 * DTEST Page signal assignments are defined in a spreadsheet located at
 * http://compass.freescale.net/livelink/livelink/open/231923338.
 */
/*@{*/
/*! @brief Read current value of the XCVR_DTEST_CTRL_DTEST_PAGE field. */
#define XCVR_RD_DTEST_CTRL_DTEST_PAGE(base) ((XCVR_DTEST_CTRL_REG(base) & XCVR_DTEST_CTRL_DTEST_PAGE_MASK) >> XCVR_DTEST_CTRL_DTEST_PAGE_SHIFT)
#define XCVR_BRD_DTEST_CTRL_DTEST_PAGE(base) (BME_UBFX32(&XCVR_DTEST_CTRL_REG(base), XCVR_DTEST_CTRL_DTEST_PAGE_SHIFT, XCVR_DTEST_CTRL_DTEST_PAGE_WIDTH))

/*! @brief Set the DTEST_PAGE field to a new value. */
#define XCVR_WR_DTEST_CTRL_DTEST_PAGE(base, value) (XCVR_RMW_DTEST_CTRL(base, XCVR_DTEST_CTRL_DTEST_PAGE_MASK, XCVR_DTEST_CTRL_DTEST_PAGE(value)))
#define XCVR_BWR_DTEST_CTRL_DTEST_PAGE(base, value) (BME_BFI32(&XCVR_DTEST_CTRL_REG(base), ((uint32_t)(value) << XCVR_DTEST_CTRL_DTEST_PAGE_SHIFT), XCVR_DTEST_CTRL_DTEST_PAGE_SHIFT, XCVR_DTEST_CTRL_DTEST_PAGE_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_DTEST_CTRL, field DTEST_EN[7] (RW)
 *
 * DTEST enable
 *
 * Values:
 * - 0b0 - Disables DTEST. The IC's DTEST pins assume their mission function.
 * - 0b1 - Enables DTEST. The contents of the selected page (DTEST_PAGE) will
 *     appear on the IC's DTEST output pins.
 */
/*@{*/
/*! @brief Read current value of the XCVR_DTEST_CTRL_DTEST_EN field. */
#define XCVR_RD_DTEST_CTRL_DTEST_EN(base) ((XCVR_DTEST_CTRL_REG(base) & XCVR_DTEST_CTRL_DTEST_EN_MASK) >> XCVR_DTEST_CTRL_DTEST_EN_SHIFT)
#define XCVR_BRD_DTEST_CTRL_DTEST_EN(base) (BME_UBFX32(&XCVR_DTEST_CTRL_REG(base), XCVR_DTEST_CTRL_DTEST_EN_SHIFT, XCVR_DTEST_CTRL_DTEST_EN_WIDTH))

/*! @brief Set the DTEST_EN field to a new value. */
#define XCVR_WR_DTEST_CTRL_DTEST_EN(base, value) (XCVR_RMW_DTEST_CTRL(base, XCVR_DTEST_CTRL_DTEST_EN_MASK, XCVR_DTEST_CTRL_DTEST_EN(value)))
#define XCVR_BWR_DTEST_CTRL_DTEST_EN(base, value) (BME_BFI32(&XCVR_DTEST_CTRL_REG(base), ((uint32_t)(value) << XCVR_DTEST_CTRL_DTEST_EN_SHIFT), XCVR_DTEST_CTRL_DTEST_EN_SHIFT, XCVR_DTEST_CTRL_DTEST_EN_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_DTEST_CTRL, field GPIO0_OVLAY_PIN[11:8] (RW)
 *
 * The TSM-controlled output GPIO0_TRIG_EN can be routed to any DTEST pin,
 * regardless of page selection (DTEST_PAGE), replacing the nominal page-selected
 * output for that pin. When TSM_GPIO_OVLAY_0 = 1, this register selects the DTEST
 * pin onto which GPIO0_TRIG_EN will appear, any of DTEST0 - DTEST13. When
 * TSM_GPIO_OVLAY_0 = 0, this register is ignored, and the DTEST Page Table dictates the
 * node that appears on each DTEST pin.
 */
/*@{*/
/*! @brief Read current value of the XCVR_DTEST_CTRL_GPIO0_OVLAY_PIN field. */
#define XCVR_RD_DTEST_CTRL_GPIO0_OVLAY_PIN(base) ((XCVR_DTEST_CTRL_REG(base) & XCVR_DTEST_CTRL_GPIO0_OVLAY_PIN_MASK) >> XCVR_DTEST_CTRL_GPIO0_OVLAY_PIN_SHIFT)
#define XCVR_BRD_DTEST_CTRL_GPIO0_OVLAY_PIN(base) (BME_UBFX32(&XCVR_DTEST_CTRL_REG(base), XCVR_DTEST_CTRL_GPIO0_OVLAY_PIN_SHIFT, XCVR_DTEST_CTRL_GPIO0_OVLAY_PIN_WIDTH))

/*! @brief Set the GPIO0_OVLAY_PIN field to a new value. */
#define XCVR_WR_DTEST_CTRL_GPIO0_OVLAY_PIN(base, value) (XCVR_RMW_DTEST_CTRL(base, XCVR_DTEST_CTRL_GPIO0_OVLAY_PIN_MASK, XCVR_DTEST_CTRL_GPIO0_OVLAY_PIN(value)))
#define XCVR_BWR_DTEST_CTRL_GPIO0_OVLAY_PIN(base, value) (BME_BFI32(&XCVR_DTEST_CTRL_REG(base), ((uint32_t)(value) << XCVR_DTEST_CTRL_GPIO0_OVLAY_PIN_SHIFT), XCVR_DTEST_CTRL_GPIO0_OVLAY_PIN_SHIFT, XCVR_DTEST_CTRL_GPIO0_OVLAY_PIN_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_DTEST_CTRL, field GPIO1_OVLAY_PIN[15:12] (RW)
 *
 * The TSM-controlled output GPIO1_TRIG_EN can be routed to any DTEST pin,
 * regardless of page selection (DTEST_PAGE), replacing the nominal page-selected
 * output for that pin. When TSM_GPIO_OVLAY_1 = 1, this register selects the DTEST
 * pin onto which GPIO1_TRIG_EN will appear, any of DTEST0 - DTEST13. When
 * TSM_GPIO_OVLAY_1 = 0, this register is ignored, and the DTEST Page Table dictates the
 * node that appears on each DTEST pin.
 */
/*@{*/
/*! @brief Read current value of the XCVR_DTEST_CTRL_GPIO1_OVLAY_PIN field. */
#define XCVR_RD_DTEST_CTRL_GPIO1_OVLAY_PIN(base) ((XCVR_DTEST_CTRL_REG(base) & XCVR_DTEST_CTRL_GPIO1_OVLAY_PIN_MASK) >> XCVR_DTEST_CTRL_GPIO1_OVLAY_PIN_SHIFT)
#define XCVR_BRD_DTEST_CTRL_GPIO1_OVLAY_PIN(base) (BME_UBFX32(&XCVR_DTEST_CTRL_REG(base), XCVR_DTEST_CTRL_GPIO1_OVLAY_PIN_SHIFT, XCVR_DTEST_CTRL_GPIO1_OVLAY_PIN_WIDTH))

/*! @brief Set the GPIO1_OVLAY_PIN field to a new value. */
#define XCVR_WR_DTEST_CTRL_GPIO1_OVLAY_PIN(base, value) (XCVR_RMW_DTEST_CTRL(base, XCVR_DTEST_CTRL_GPIO1_OVLAY_PIN_MASK, XCVR_DTEST_CTRL_GPIO1_OVLAY_PIN(value)))
#define XCVR_BWR_DTEST_CTRL_GPIO1_OVLAY_PIN(base, value) (BME_BFI32(&XCVR_DTEST_CTRL_REG(base), ((uint32_t)(value) << XCVR_DTEST_CTRL_GPIO1_OVLAY_PIN_SHIFT), XCVR_DTEST_CTRL_GPIO1_OVLAY_PIN_SHIFT, XCVR_DTEST_CTRL_GPIO1_OVLAY_PIN_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_DTEST_CTRL, field TSM_GPIO_OVLAY_0[16] (RW)
 *
 * The TSM-controlled output GPIO0_TRIG_EN can be routed to any DTEST pin,
 * regardless of page selection (DTEST_PAGE), replacing the nominal page-selected
 * output for that pin. When TSM_GPIO_OVLAY_0 = 1, the register GPIO0_OVLAY_PIN[3:0]
 * selects the DTEST pin on which GPIO0_TRIG_EN will appear, any of DTEST0 -
 * DTEST13. When TSM_GPIO_OVLAY_0 = 0, there is no overlay, and the DTEST Page Table
 * dictates the node that appears on each DTEST pin.
 *
 * Values:
 * - 0b0 - there is no overlay, and the DTEST Page Table dictates the node that
 *     appears on each DTEST pin.
 * - 0b1 - the register GPIO0_OVLAY_PIN[3:0] selects the DTEST pin on which
 *     GPIO0_TRIG_EN will appear.
 */
/*@{*/
/*! @brief Read current value of the XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_0 field. */
#define XCVR_RD_DTEST_CTRL_TSM_GPIO_OVLAY_0(base) ((XCVR_DTEST_CTRL_REG(base) & XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_0_MASK) >> XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_0_SHIFT)
#define XCVR_BRD_DTEST_CTRL_TSM_GPIO_OVLAY_0(base) (BME_UBFX32(&XCVR_DTEST_CTRL_REG(base), XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_0_SHIFT, XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_0_WIDTH))

/*! @brief Set the TSM_GPIO_OVLAY_0 field to a new value. */
#define XCVR_WR_DTEST_CTRL_TSM_GPIO_OVLAY_0(base, value) (XCVR_RMW_DTEST_CTRL(base, XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_0_MASK, XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_0(value)))
#define XCVR_BWR_DTEST_CTRL_TSM_GPIO_OVLAY_0(base, value) (BME_BFI32(&XCVR_DTEST_CTRL_REG(base), ((uint32_t)(value) << XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_0_SHIFT), XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_0_SHIFT, XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_0_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_DTEST_CTRL, field TSM_GPIO_OVLAY_1[17] (RW)
 *
 * The TSM-controlled output GPIO1_TRIG_EN can be routed to any DTEST pin,
 * regardless of page selection (DTEST_PAGE), replacing the nominal page-selected
 * output for that pin. When TSM_GPIO_OVLAY_1 = 1, the register GPIO1_OVLAY_PIN[3:0]
 * selects the DTEST pin on which GPIO1_TRIG_EN will appear, any of DTEST0 -
 * DTEST13. When TSM_GPIO_OVLAY_1 = 0, there is no overlay, and the DTEST Page Table
 * dictates the node that appears on each DTEST pin.
 *
 * Values:
 * - 0b0 - there is no overlay, and the DTEST Page Table dictates the node that
 *     appears on each DTEST pin.
 * - 0b1 - the register GPIO1_OVLAY_PIN[3:0] selects the DTEST pin on which
 *     GPIO1_TRIG_EN will appear.
 */
/*@{*/
/*! @brief Read current value of the XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_1 field. */
#define XCVR_RD_DTEST_CTRL_TSM_GPIO_OVLAY_1(base) ((XCVR_DTEST_CTRL_REG(base) & XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_1_MASK) >> XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_1_SHIFT)
#define XCVR_BRD_DTEST_CTRL_TSM_GPIO_OVLAY_1(base) (BME_UBFX32(&XCVR_DTEST_CTRL_REG(base), XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_1_SHIFT, XCVR_DTEST_CTRL_TSM_GPIO_OVLAY_1_WIDTH))

