RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW20Z4/include/MKW20Z4_extension.h
/*******************************************************************************
 * XCVR_TSM_TIMING18 - TSM_TIMING18
 ******************************************************************************/

/*!
 * @brief XCVR_TSM_TIMING18 - TSM_TIMING18 (RW)
 *
 * Reset value: 0x6505FFFFU
 *
 * This register contains the timing values to control the assertion and
 * deassertion times for both TX and RX sequences for the QGEN25_EN TSM signal or signal
 * group.
 */
/*!
 * @name Constants and macros for entire XCVR_TSM_TIMING18 register
 */
/*@{*/
#define XCVR_RD_TSM_TIMING18(base) (XCVR_TSM_TIMING18_REG(base))
#define XCVR_WR_TSM_TIMING18(base, value) (XCVR_TSM_TIMING18_REG(base) = (value))
#define XCVR_RMW_TSM_TIMING18(base, mask, value) (XCVR_WR_TSM_TIMING18(base, (XCVR_RD_TSM_TIMING18(base) & ~(mask)) | (value)))
#define XCVR_SET_TSM_TIMING18(base, value) (BME_OR32(&XCVR_TSM_TIMING18_REG(base), (uint32_t)(value)))
#define XCVR_CLR_TSM_TIMING18(base, value) (BME_AND32(&XCVR_TSM_TIMING18_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_TSM_TIMING18(base, value) (BME_XOR32(&XCVR_TSM_TIMING18_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XCVR_TSM_TIMING18 bitfields
 */

/*!
 * @name Register XCVR_TSM_TIMING18, field QGEN25_EN_RX_HI[23:16] (RW)
 *
 * This field sets the point during a TSM RX sequence (the tsm_count[7:0] value)
 * at which the QGEN25_EN signal or group will transition from LO to HI.
 */
/*@{*/
/*! @brief Read current value of the XCVR_TSM_TIMING18_QGEN25_EN_RX_HI field. */
#define XCVR_RD_TSM_TIMING18_QGEN25_EN_RX_HI(base) ((XCVR_TSM_TIMING18_REG(base) & XCVR_TSM_TIMING18_QGEN25_EN_RX_HI_MASK) >> XCVR_TSM_TIMING18_QGEN25_EN_RX_HI_SHIFT)
#define XCVR_BRD_TSM_TIMING18_QGEN25_EN_RX_HI(base) (BME_UBFX32(&XCVR_TSM_TIMING18_REG(base), XCVR_TSM_TIMING18_QGEN25_EN_RX_HI_SHIFT, XCVR_TSM_TIMING18_QGEN25_EN_RX_HI_WIDTH))

/*! @brief Set the QGEN25_EN_RX_HI field to a new value. */
#define XCVR_WR_TSM_TIMING18_QGEN25_EN_RX_HI(base, value) (XCVR_RMW_TSM_TIMING18(base, XCVR_TSM_TIMING18_QGEN25_EN_RX_HI_MASK, XCVR_TSM_TIMING18_QGEN25_EN_RX_HI(value)))
#define XCVR_BWR_TSM_TIMING18_QGEN25_EN_RX_HI(base, value) (BME_BFI32(&XCVR_TSM_TIMING18_REG(base), ((uint32_t)(value) << XCVR_TSM_TIMING18_QGEN25_EN_RX_HI_SHIFT), XCVR_TSM_TIMING18_QGEN25_EN_RX_HI_SHIFT, XCVR_TSM_TIMING18_QGEN25_EN_RX_HI_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TSM_TIMING18, field QGEN25_EN_RX_LO[31:24] (RW)
 *
 * This field sets the point during a TSM RX sequence (the tsm_count[7:0] value)
 * at which the QGEN25_EN signal or group will transition from HI to LO.
 */
/*@{*/
/*! @brief Read current value of the XCVR_TSM_TIMING18_QGEN25_EN_RX_LO field. */
#define XCVR_RD_TSM_TIMING18_QGEN25_EN_RX_LO(base) ((XCVR_TSM_TIMING18_REG(base) & XCVR_TSM_TIMING18_QGEN25_EN_RX_LO_MASK) >> XCVR_TSM_TIMING18_QGEN25_EN_RX_LO_SHIFT)
#define XCVR_BRD_TSM_TIMING18_QGEN25_EN_RX_LO(base) (BME_UBFX32(&XCVR_TSM_TIMING18_REG(base), XCVR_TSM_TIMING18_QGEN25_EN_RX_LO_SHIFT, XCVR_TSM_TIMING18_QGEN25_EN_RX_LO_WIDTH))

/*! @brief Set the QGEN25_EN_RX_LO field to a new value. */
#define XCVR_WR_TSM_TIMING18_QGEN25_EN_RX_LO(base, value) (XCVR_RMW_TSM_TIMING18(base, XCVR_TSM_TIMING18_QGEN25_EN_RX_LO_MASK, XCVR_TSM_TIMING18_QGEN25_EN_RX_LO(value)))
#define XCVR_BWR_TSM_TIMING18_QGEN25_EN_RX_LO(base, value) (BME_BFI32(&XCVR_TSM_TIMING18_REG(base), ((uint32_t)(value) << XCVR_TSM_TIMING18_QGEN25_EN_RX_LO_SHIFT), XCVR_TSM_TIMING18_QGEN25_EN_RX_LO_SHIFT, XCVR_TSM_TIMING18_QGEN25_EN_RX_LO_WIDTH))
/*@}*/

/*******************************************************************************
 * XCVR_TSM_TIMING19 - TSM_TIMING19
 ******************************************************************************/

/*!
 * @brief XCVR_TSM_TIMING19 - TSM_TIMING19 (RW)
 *
 * Reset value: 0xFFFF6864U
 *
 * This register contains the timing values to control the assertion and
 * deassertion times for both TX and RX sequences for the TX_EN TSM signal or signal
 * group.
 */
/*!
 * @name Constants and macros for entire XCVR_TSM_TIMING19 register
 */
/*@{*/
#define XCVR_RD_TSM_TIMING19(base) (XCVR_TSM_TIMING19_REG(base))
#define XCVR_WR_TSM_TIMING19(base, value) (XCVR_TSM_TIMING19_REG(base) = (value))
#define XCVR_RMW_TSM_TIMING19(base, mask, value) (XCVR_WR_TSM_TIMING19(base, (XCVR_RD_TSM_TIMING19(base) & ~(mask)) | (value)))
#define XCVR_SET_TSM_TIMING19(base, value) (BME_OR32(&XCVR_TSM_TIMING19_REG(base), (uint32_t)(value)))
#define XCVR_CLR_TSM_TIMING19(base, value) (BME_AND32(&XCVR_TSM_TIMING19_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_TSM_TIMING19(base, value) (BME_XOR32(&XCVR_TSM_TIMING19_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XCVR_TSM_TIMING19 bitfields
 */

/*!
 * @name Register XCVR_TSM_TIMING19, field TX_EN_TX_HI[7:0] (RW)
 *
 * This field sets the point during a TSM TX sequence (the tsm_count[7:0] value)
 * at which the TX_EN signal or group will transition from LO to HI.
 */
/*@{*/
/*! @brief Read current value of the XCVR_TSM_TIMING19_TX_EN_TX_HI field. */
#define XCVR_RD_TSM_TIMING19_TX_EN_TX_HI(base) ((XCVR_TSM_TIMING19_REG(base) & XCVR_TSM_TIMING19_TX_EN_TX_HI_MASK) >> XCVR_TSM_TIMING19_TX_EN_TX_HI_SHIFT)
#define XCVR_BRD_TSM_TIMING19_TX_EN_TX_HI(base) (BME_UBFX32(&XCVR_TSM_TIMING19_REG(base), XCVR_TSM_TIMING19_TX_EN_TX_HI_SHIFT, XCVR_TSM_TIMING19_TX_EN_TX_HI_WIDTH))

/*! @brief Set the TX_EN_TX_HI field to a new value. */
#define XCVR_WR_TSM_TIMING19_TX_EN_TX_HI(base, value) (XCVR_RMW_TSM_TIMING19(base, XCVR_TSM_TIMING19_TX_EN_TX_HI_MASK, XCVR_TSM_TIMING19_TX_EN_TX_HI(value)))
#define XCVR_BWR_TSM_TIMING19_TX_EN_TX_HI(base, value) (BME_BFI32(&XCVR_TSM_TIMING19_REG(base), ((uint32_t)(value) << XCVR_TSM_TIMING19_TX_EN_TX_HI_SHIFT), XCVR_TSM_TIMING19_TX_EN_TX_HI_SHIFT, XCVR_TSM_TIMING19_TX_EN_TX_HI_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TSM_TIMING19, field TX_EN_TX_LO[15:8] (RW)
 *
 * This field sets the point during a TSM TX sequence (the tsm_count[7:0] value)
 * at which the TX_EN signal or group will transition from HI to LO.
 */
/*@{*/
/*! @brief Read current value of the XCVR_TSM_TIMING19_TX_EN_TX_LO field. */
#define XCVR_RD_TSM_TIMING19_TX_EN_TX_LO(base) ((XCVR_TSM_TIMING19_REG(base) & XCVR_TSM_TIMING19_TX_EN_TX_LO_MASK) >> XCVR_TSM_TIMING19_TX_EN_TX_LO_SHIFT)
#define XCVR_BRD_TSM_TIMING19_TX_EN_TX_LO(base) (BME_UBFX32(&XCVR_TSM_TIMING19_REG(base), XCVR_TSM_TIMING19_TX_EN_TX_LO_SHIFT, XCVR_TSM_TIMING19_TX_EN_TX_LO_WIDTH))

/*! @brief Set the TX_EN_TX_LO field to a new value. */
#define XCVR_WR_TSM_TIMING19_TX_EN_TX_LO(base, value) (XCVR_RMW_TSM_TIMING19(base, XCVR_TSM_TIMING19_TX_EN_TX_LO_MASK, XCVR_TSM_TIMING19_TX_EN_TX_LO(value)))
#define XCVR_BWR_TSM_TIMING19_TX_EN_TX_LO(base, value) (BME_BFI32(&XCVR_TSM_TIMING19_REG(base), ((uint32_t)(value) << XCVR_TSM_TIMING19_TX_EN_TX_LO_SHIFT), XCVR_TSM_TIMING19_TX_EN_TX_LO_SHIFT, XCVR_TSM_TIMING19_TX_EN_TX_LO_WIDTH))
/*@}*/

