RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW20Z4/include/MKW20Z4_extension.h
/*******************************************************************************
 * ZLL_EVENT_TMR - EVENT TIMER
 ******************************************************************************/

/*!
 * @brief ZLL_EVENT_TMR - EVENT TIMER (RO)
 *
 * Reset value: 0x00000000U
 *
 * Holds the current value of the 24-bit event timer. The hardware latches the
 * upper 2 bytes of EVENT_TMR on each read of least signficant byte.
 */
/*!
 * @name Constants and macros for entire ZLL_EVENT_TMR register
 */
/*@{*/
#define ZLL_RD_EVENT_TMR(base)   (ZLL_EVENT_TMR_REG(base))
/*@}*/

/*
 * Constants & macros for individual ZLL_EVENT_TMR bitfields
 */

/*!
 * @name Register ZLL_EVENT_TMR, field EVENT_TMR[23:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ZLL_EVENT_TMR_EVENT_TMR field. */
#define ZLL_RD_EVENT_TMR_EVENT_TMR(base) ((ZLL_EVENT_TMR_REG(base) & ZLL_EVENT_TMR_EVENT_TMR_MASK) >> ZLL_EVENT_TMR_EVENT_TMR_SHIFT)
#define ZLL_BRD_EVENT_TMR_EVENT_TMR(base) (ZLL_RD_EVENT_TMR_EVENT_TMR(base))
/*@}*/

/*******************************************************************************
 * ZLL_TIMESTAMP - TIMESTAMP
 ******************************************************************************/

/*!
 * @brief ZLL_TIMESTAMP - TIMESTAMP (RO)
 *
 * Reset value: 0x00000000U
 *
 * Holds the latched value of the Event Timer current time corresponding to the
 * beginning of the just received Rx packet, at SFD detect.
 */
/*!
 * @name Constants and macros for entire ZLL_TIMESTAMP register
 */
/*@{*/
#define ZLL_RD_TIMESTAMP(base)   (ZLL_TIMESTAMP_REG(base))
/*@}*/

/*
 * Constants & macros for individual ZLL_TIMESTAMP bitfields
 */

/*!
 * @name Register ZLL_TIMESTAMP, field TIMESTAMP[23:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ZLL_TIMESTAMP_TIMESTAMP field. */
#define ZLL_RD_TIMESTAMP_TIMESTAMP(base) ((ZLL_TIMESTAMP_REG(base) & ZLL_TIMESTAMP_TIMESTAMP_MASK) >> ZLL_TIMESTAMP_TIMESTAMP_SHIFT)
#define ZLL_BRD_TIMESTAMP_TIMESTAMP(base) (ZLL_RD_TIMESTAMP_TIMESTAMP(base))
/*@}*/

/*******************************************************************************
 * ZLL_T1CMP - T1 COMPARE
 ******************************************************************************/

/*!
 * @brief ZLL_T1CMP - T1 COMPARE (RW)
 *
 * Reset value: 0x00FFFFFFU
 *
 * TMR1 compare value. If TMR1CMP_EN=1 and the Event Timer matches this value,
 * TMR1IRQ is set.
 */
/*!
 * @name Constants and macros for entire ZLL_T1CMP register
 */
/*@{*/
#define ZLL_RD_T1CMP(base)       (ZLL_T1CMP_REG(base))
#define ZLL_WR_T1CMP(base, value) (ZLL_T1CMP_REG(base) = (value))
#define ZLL_RMW_T1CMP(base, mask, value) (ZLL_WR_T1CMP(base, (ZLL_RD_T1CMP(base) & ~(mask)) | (value)))
#define ZLL_SET_T1CMP(base, value) (BME_OR32(&ZLL_T1CMP_REG(base), (uint32_t)(value)))
#define ZLL_CLR_T1CMP(base, value) (BME_AND32(&ZLL_T1CMP_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_T1CMP(base, value) (BME_XOR32(&ZLL_T1CMP_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_T1CMP bitfields
 */

/*!
 * @name Register ZLL_T1CMP, field T1CMP[23:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ZLL_T1CMP_T1CMP field. */
#define ZLL_RD_T1CMP_T1CMP(base) ((ZLL_T1CMP_REG(base) & ZLL_T1CMP_T1CMP_MASK) >> ZLL_T1CMP_T1CMP_SHIFT)
#define ZLL_BRD_T1CMP_T1CMP(base) (ZLL_RD_T1CMP_T1CMP(base))

/*! @brief Set the T1CMP field to a new value. */
#define ZLL_WR_T1CMP_T1CMP(base, value) (ZLL_RMW_T1CMP(base, ZLL_T1CMP_T1CMP_MASK, ZLL_T1CMP_T1CMP(value)))
#define ZLL_BWR_T1CMP_T1CMP(base, value) (ZLL_WR_T1CMP_T1CMP(base, value))
/*@}*/

/*******************************************************************************
 * ZLL_T2CMP - T2 COMPARE
 ******************************************************************************/

/*!
 * @brief ZLL_T2CMP - T2 COMPARE (RW)
 *
 * Reset value: 0x00FFFFFFU
 *
 * TMR2 compare value. If TMR2CMP_EN=1 and TC2PRIME_EN=0 and the Event Timer
 * matches this value, TMR2IRQ is set.
 */
/*!
 * @name Constants and macros for entire ZLL_T2CMP register
 */
/*@{*/
#define ZLL_RD_T2CMP(base)       (ZLL_T2CMP_REG(base))
#define ZLL_WR_T2CMP(base, value) (ZLL_T2CMP_REG(base) = (value))
#define ZLL_RMW_T2CMP(base, mask, value) (ZLL_WR_T2CMP(base, (ZLL_RD_T2CMP(base) & ~(mask)) | (value)))
#define ZLL_SET_T2CMP(base, value) (BME_OR32(&ZLL_T2CMP_REG(base), (uint32_t)(value)))
#define ZLL_CLR_T2CMP(base, value) (BME_AND32(&ZLL_T2CMP_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_T2CMP(base, value) (BME_XOR32(&ZLL_T2CMP_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_T2CMP bitfields
 */

/*!
 * @name Register ZLL_T2CMP, field T2CMP[23:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ZLL_T2CMP_T2CMP field. */
#define ZLL_RD_T2CMP_T2CMP(base) ((ZLL_T2CMP_REG(base) & ZLL_T2CMP_T2CMP_MASK) >> ZLL_T2CMP_T2CMP_SHIFT)
#define ZLL_BRD_T2CMP_T2CMP(base) (ZLL_RD_T2CMP_T2CMP(base))

/*! @brief Set the T2CMP field to a new value. */
#define ZLL_WR_T2CMP_T2CMP(base, value) (ZLL_RMW_T2CMP(base, ZLL_T2CMP_T2CMP_MASK, ZLL_T2CMP_T2CMP(value)))
#define ZLL_BWR_T2CMP_T2CMP(base, value) (ZLL_WR_T2CMP_T2CMP(base, value))
/*@}*/

/*******************************************************************************
 * ZLL_T2PRIMECMP - T2 PRIME COMPARE
 ******************************************************************************/

/*!
 * @brief ZLL_T2PRIMECMP - T2 PRIME COMPARE (RW)
 *
 * Reset value: 0x0000FFFFU
 *
 * TMR2 compare value. If TMR2CMP_EN=1 and TC2PRIME_EN=1 and the Event Timer
 * matches this value, TMR2IRQ is set.
 */
/*!
 * @name Constants and macros for entire ZLL_T2PRIMECMP register
 */
/*@{*/
#define ZLL_RD_T2PRIMECMP(base)  (ZLL_T2PRIMECMP_REG(base))
#define ZLL_WR_T2PRIMECMP(base, value) (ZLL_T2PRIMECMP_REG(base) = (value))
#define ZLL_RMW_T2PRIMECMP(base, mask, value) (ZLL_WR_T2PRIMECMP(base, (ZLL_RD_T2PRIMECMP(base) & ~(mask)) | (value)))
#define ZLL_SET_T2PRIMECMP(base, value) (BME_OR32(&ZLL_T2PRIMECMP_REG(base), (uint32_t)(value)))
#define ZLL_CLR_T2PRIMECMP(base, value) (BME_AND32(&ZLL_T2PRIMECMP_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_T2PRIMECMP(base, value) (BME_XOR32(&ZLL_T2PRIMECMP_REG(base), (uint32_t)(value)))
/*@}*/

