RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW20Z4/include/MKW20Z4_extension.h
/*
 * Constants & macros for individual ZLL_CHANNEL_NUM0 bitfields
 */

/*!
 * @name Register ZLL_CHANNEL_NUM0, field CHANNEL_NUM0[6:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ZLL_CHANNEL_NUM0_CHANNEL_NUM0 field. */
#define ZLL_RD_CHANNEL_NUM0_CHANNEL_NUM0(base) ((ZLL_CHANNEL_NUM0_REG(base) & ZLL_CHANNEL_NUM0_CHANNEL_NUM0_MASK) >> ZLL_CHANNEL_NUM0_CHANNEL_NUM0_SHIFT)
#define ZLL_BRD_CHANNEL_NUM0_CHANNEL_NUM0(base) (BME_UBFX32(&ZLL_CHANNEL_NUM0_REG(base), ZLL_CHANNEL_NUM0_CHANNEL_NUM0_SHIFT, ZLL_CHANNEL_NUM0_CHANNEL_NUM0_WIDTH))

/*! @brief Set the CHANNEL_NUM0 field to a new value. */
#define ZLL_WR_CHANNEL_NUM0_CHANNEL_NUM0(base, value) (ZLL_RMW_CHANNEL_NUM0(base, ZLL_CHANNEL_NUM0_CHANNEL_NUM0_MASK, ZLL_CHANNEL_NUM0_CHANNEL_NUM0(value)))
#define ZLL_BWR_CHANNEL_NUM0_CHANNEL_NUM0(base, value) (BME_BFI32(&ZLL_CHANNEL_NUM0_REG(base), ((uint32_t)(value) << ZLL_CHANNEL_NUM0_CHANNEL_NUM0_SHIFT), ZLL_CHANNEL_NUM0_CHANNEL_NUM0_SHIFT, ZLL_CHANNEL_NUM0_CHANNEL_NUM0_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_LQI_AND_RSSI - LQI AND RSSI
 ******************************************************************************/

/*!
 * @brief ZLL_LQI_AND_RSSI - LQI AND RSSI (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ZLL_LQI_AND_RSSI register
 */
/*@{*/
#define ZLL_RD_LQI_AND_RSSI(base) (ZLL_LQI_AND_RSSI_REG(base))
/*@}*/

/*
 * Constants & macros for individual ZLL_LQI_AND_RSSI bitfields
 */

/*!
 * @name Register ZLL_LQI_AND_RSSI, field LQI_VALUE[7:0] (RO)
 *
 * Link Quality Indicator for the most recently received packet. (LQI is also
 * available in the Packet Buffer, at the end of the received packet data)
 */
/*@{*/
/*! @brief Read current value of the ZLL_LQI_AND_RSSI_LQI_VALUE field. */
#define ZLL_RD_LQI_AND_RSSI_LQI_VALUE(base) ((ZLL_LQI_AND_RSSI_REG(base) & ZLL_LQI_AND_RSSI_LQI_VALUE_MASK) >> ZLL_LQI_AND_RSSI_LQI_VALUE_SHIFT)
#define ZLL_BRD_LQI_AND_RSSI_LQI_VALUE(base) (BME_UBFX32(&ZLL_LQI_AND_RSSI_REG(base), ZLL_LQI_AND_RSSI_LQI_VALUE_SHIFT, ZLL_LQI_AND_RSSI_LQI_VALUE_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_LQI_AND_RSSI, field RSSI[15:8] (RO)
 *
 * RSSI Output
 */
/*@{*/
/*! @brief Read current value of the ZLL_LQI_AND_RSSI_RSSI field. */
#define ZLL_RD_LQI_AND_RSSI_RSSI(base) ((ZLL_LQI_AND_RSSI_REG(base) & ZLL_LQI_AND_RSSI_RSSI_MASK) >> ZLL_LQI_AND_RSSI_RSSI_SHIFT)
#define ZLL_BRD_LQI_AND_RSSI_RSSI(base) (BME_UBFX32(&ZLL_LQI_AND_RSSI_REG(base), ZLL_LQI_AND_RSSI_RSSI_SHIFT, ZLL_LQI_AND_RSSI_RSSI_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_LQI_AND_RSSI, field CCA1_ED_FNL[23:16] (RO)
 *
 * Output register to show final averaged RSSI value or compensated value of the
 * same at the end of a CCA Mode1 or Energy Detect computation.
 */
/*@{*/
/*! @brief Read current value of the ZLL_LQI_AND_RSSI_CCA1_ED_FNL field. */
#define ZLL_RD_LQI_AND_RSSI_CCA1_ED_FNL(base) ((ZLL_LQI_AND_RSSI_REG(base) & ZLL_LQI_AND_RSSI_CCA1_ED_FNL_MASK) >> ZLL_LQI_AND_RSSI_CCA1_ED_FNL_SHIFT)
#define ZLL_BRD_LQI_AND_RSSI_CCA1_ED_FNL(base) (BME_UBFX32(&ZLL_LQI_AND_RSSI_REG(base), ZLL_LQI_AND_RSSI_CCA1_ED_FNL_SHIFT, ZLL_LQI_AND_RSSI_CCA1_ED_FNL_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_MACSHORTADDRS0 - MAC SHORT ADDRESS 0
 ******************************************************************************/

/*!
 * @brief ZLL_MACSHORTADDRS0 - MAC SHORT ADDRESS 0 (RW)
 *
 * Reset value: 0xFFFFFFFFU
 */
/*!
 * @name Constants and macros for entire ZLL_MACSHORTADDRS0 register
 */
/*@{*/
#define ZLL_RD_MACSHORTADDRS0(base) (ZLL_MACSHORTADDRS0_REG(base))
#define ZLL_WR_MACSHORTADDRS0(base, value) (ZLL_MACSHORTADDRS0_REG(base) = (value))
#define ZLL_RMW_MACSHORTADDRS0(base, mask, value) (ZLL_WR_MACSHORTADDRS0(base, (ZLL_RD_MACSHORTADDRS0(base) & ~(mask)) | (value)))
#define ZLL_SET_MACSHORTADDRS0(base, value) (BME_OR32(&ZLL_MACSHORTADDRS0_REG(base), (uint32_t)(value)))
#define ZLL_CLR_MACSHORTADDRS0(base, value) (BME_AND32(&ZLL_MACSHORTADDRS0_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_MACSHORTADDRS0(base, value) (BME_XOR32(&ZLL_MACSHORTADDRS0_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_MACSHORTADDRS0 bitfields
 */

/*!
 * @name Register ZLL_MACSHORTADDRS0, field MACPANID0[15:0] (RW)
 *
 * MAC PAN ID for PAN0. The packet processor compares the incoming packet's
 * Destination PAN ID against the contents of this register to determine if the
 * packet is addressed to this device; or if the incoming packet is a Beacon frame,
 * the packet processor compares the incoming packet Source PAN ID against this
 * register. Also, if PANCORDNTR0=1, and the incoming packet has no Destination
 * Address field, and if the incoming packet is a Data or MAC Command frame, the
 * packet processor compares the incoming packet Source PAN ID against this register.
 */
/*@{*/
/*! @brief Read current value of the ZLL_MACSHORTADDRS0_MACPANID0 field. */
#define ZLL_RD_MACSHORTADDRS0_MACPANID0(base) ((ZLL_MACSHORTADDRS0_REG(base) & ZLL_MACSHORTADDRS0_MACPANID0_MASK) >> ZLL_MACSHORTADDRS0_MACPANID0_SHIFT)
#define ZLL_BRD_MACSHORTADDRS0_MACPANID0(base) (BME_UBFX32(&ZLL_MACSHORTADDRS0_REG(base), ZLL_MACSHORTADDRS0_MACPANID0_SHIFT, ZLL_MACSHORTADDRS0_MACPANID0_WIDTH))

/*! @brief Set the MACPANID0 field to a new value. */
#define ZLL_WR_MACSHORTADDRS0_MACPANID0(base, value) (ZLL_RMW_MACSHORTADDRS0(base, ZLL_MACSHORTADDRS0_MACPANID0_MASK, ZLL_MACSHORTADDRS0_MACPANID0(value)))
#define ZLL_BWR_MACSHORTADDRS0_MACPANID0(base, value) (BME_BFI32(&ZLL_MACSHORTADDRS0_REG(base), ((uint32_t)(value) << ZLL_MACSHORTADDRS0_MACPANID0_SHIFT), ZLL_MACSHORTADDRS0_MACPANID0_SHIFT, ZLL_MACSHORTADDRS0_MACPANID0_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_MACSHORTADDRS0, field MACSHORTADDRS0[31:16] (RW)
 *
 * MAC Short Address for PAN0, for 16-bit destination addressing mode. The
 * packet processor compares the incoming packet's Destination Address against the
 * contents of this register to determine if the packet is addressed to this device.
 */
/*@{*/
/*! @brief Read current value of the ZLL_MACSHORTADDRS0_MACSHORTADDRS0 field. */
#define ZLL_RD_MACSHORTADDRS0_MACSHORTADDRS0(base) ((ZLL_MACSHORTADDRS0_REG(base) & ZLL_MACSHORTADDRS0_MACSHORTADDRS0_MASK) >> ZLL_MACSHORTADDRS0_MACSHORTADDRS0_SHIFT)
#define ZLL_BRD_MACSHORTADDRS0_MACSHORTADDRS0(base) (BME_UBFX32(&ZLL_MACSHORTADDRS0_REG(base), ZLL_MACSHORTADDRS0_MACSHORTADDRS0_SHIFT, ZLL_MACSHORTADDRS0_MACSHORTADDRS0_WIDTH))

/*! @brief Set the MACSHORTADDRS0 field to a new value. */
#define ZLL_WR_MACSHORTADDRS0_MACSHORTADDRS0(base, value) (ZLL_RMW_MACSHORTADDRS0(base, ZLL_MACSHORTADDRS0_MACSHORTADDRS0_MASK, ZLL_MACSHORTADDRS0_MACSHORTADDRS0(value)))
#define ZLL_BWR_MACSHORTADDRS0_MACSHORTADDRS0(base, value) (BME_BFI32(&ZLL_MACSHORTADDRS0_REG(base), ((uint32_t)(value) << ZLL_MACSHORTADDRS0_MACSHORTADDRS0_SHIFT), ZLL_MACSHORTADDRS0_MACSHORTADDRS0_SHIFT, ZLL_MACSHORTADDRS0_MACSHORTADDRS0_WIDTH))
/*@}*/

