RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW20Z4/include/MKW20Z4_extension.h
/*! @brief Set the SAP1_START field to a new value. */
#define ZLL_WR_SAM_CTRL_SAP1_START(base, value) (ZLL_RMW_SAM_CTRL(base, ZLL_SAM_CTRL_SAP1_START_MASK, ZLL_SAM_CTRL_SAP1_START(value)))
#define ZLL_BWR_SAM_CTRL_SAP1_START(base, value) (BME_BFI32(&ZLL_SAM_CTRL_REG(base), ((uint32_t)(value) << ZLL_SAM_CTRL_SAP1_START_SHIFT), ZLL_SAM_CTRL_SAP1_START_SHIFT, ZLL_SAM_CTRL_SAP1_START_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SAM_CTRL, field SAA1_START[31:24] (RW)
 */
/*@{*/
/*! @brief Read current value of the ZLL_SAM_CTRL_SAA1_START field. */
#define ZLL_RD_SAM_CTRL_SAA1_START(base) ((ZLL_SAM_CTRL_REG(base) & ZLL_SAM_CTRL_SAA1_START_MASK) >> ZLL_SAM_CTRL_SAA1_START_SHIFT)
#define ZLL_BRD_SAM_CTRL_SAA1_START(base) (BME_UBFX32(&ZLL_SAM_CTRL_REG(base), ZLL_SAM_CTRL_SAA1_START_SHIFT, ZLL_SAM_CTRL_SAA1_START_WIDTH))

/*! @brief Set the SAA1_START field to a new value. */
#define ZLL_WR_SAM_CTRL_SAA1_START(base, value) (ZLL_RMW_SAM_CTRL(base, ZLL_SAM_CTRL_SAA1_START_MASK, ZLL_SAM_CTRL_SAA1_START(value)))
#define ZLL_BWR_SAM_CTRL_SAA1_START(base, value) (BME_BFI32(&ZLL_SAM_CTRL_REG(base), ((uint32_t)(value) << ZLL_SAM_CTRL_SAA1_START_SHIFT), ZLL_SAM_CTRL_SAA1_START_SHIFT, ZLL_SAM_CTRL_SAA1_START_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_SAM_TABLE - SOURCE ADDRESS MANAGEMENT TABLE
 ******************************************************************************/

/*!
 * @brief ZLL_SAM_TABLE - SOURCE ADDRESS MANAGEMENT TABLE (RW)
 *
 * Reset value: 0x00000000U
 *
 * Source Address Management Table
 */
/*!
 * @name Constants and macros for entire ZLL_SAM_TABLE register
 */
/*@{*/
#define ZLL_RD_SAM_TABLE(base)   (ZLL_SAM_TABLE_REG(base))
#define ZLL_WR_SAM_TABLE(base, value) (ZLL_SAM_TABLE_REG(base) = (value))
#define ZLL_RMW_SAM_TABLE(base, mask, value) (ZLL_WR_SAM_TABLE(base, (ZLL_RD_SAM_TABLE(base) & ~(mask)) | (value)))
#define ZLL_SET_SAM_TABLE(base, value) (BME_OR32(&ZLL_SAM_TABLE_REG(base), (uint32_t)(value)))
#define ZLL_CLR_SAM_TABLE(base, value) (BME_AND32(&ZLL_SAM_TABLE_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_SAM_TABLE(base, value) (BME_XOR32(&ZLL_SAM_TABLE_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_SAM_TABLE bitfields
 */

/*!
 * @name Register ZLL_SAM_TABLE, field SAM_INDEX[6:0] (RW)
 *
 * Contains the table index to be enabled or invalidated. Software must ensure
 * that the index is within the range of the desired partition.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SAM_TABLE_SAM_INDEX field. */
#define ZLL_RD_SAM_TABLE_SAM_INDEX(base) ((ZLL_SAM_TABLE_REG(base) & ZLL_SAM_TABLE_SAM_INDEX_MASK) >> ZLL_SAM_TABLE_SAM_INDEX_SHIFT)
#define ZLL_BRD_SAM_TABLE_SAM_INDEX(base) (BME_UBFX32(&ZLL_SAM_TABLE_REG(base), ZLL_SAM_TABLE_SAM_INDEX_SHIFT, ZLL_SAM_TABLE_SAM_INDEX_WIDTH))

/*! @brief Set the SAM_INDEX field to a new value. */
#define ZLL_WR_SAM_TABLE_SAM_INDEX(base, value) (ZLL_RMW_SAM_TABLE(base, ZLL_SAM_TABLE_SAM_INDEX_MASK, ZLL_SAM_TABLE_SAM_INDEX(value)))
#define ZLL_BWR_SAM_TABLE_SAM_INDEX(base, value) (BME_BFI32(&ZLL_SAM_TABLE_REG(base), ((uint32_t)(value) << ZLL_SAM_TABLE_SAM_INDEX_SHIFT), ZLL_SAM_TABLE_SAM_INDEX_SHIFT, ZLL_SAM_TABLE_SAM_INDEX_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SAM_TABLE, field SAM_INDEX_WR[7] (WO)
 *
 * For 32-bit writes, SAM_INDEX_WR must be set to indicate that the table entry
 * specified by SAM_INDEX[6:0] is to be written; if SAM_INDEX_WR=0, the table
 * entry is not written, but the SAM_INDEX[6:0] register is updated. For 8-bit
 * writes, this bit is ignored.
 */
/*@{*/
/*! @brief Set the SAM_INDEX_WR field to a new value. */
#define ZLL_WR_SAM_TABLE_SAM_INDEX_WR(base, value) (ZLL_RMW_SAM_TABLE(base, ZLL_SAM_TABLE_SAM_INDEX_WR_MASK, ZLL_SAM_TABLE_SAM_INDEX_WR(value)))
#define ZLL_BWR_SAM_TABLE_SAM_INDEX_WR(base, value) (ZLL_WR_SAM_TABLE_SAM_INDEX_WR(base, value))
/*@}*/

/*!
 * @name Register ZLL_SAM_TABLE, field SAM_CHECKSUM[23:8] (RW)
 *
 * Software-computed source address checksum, to be installed into a table
 * index. The value on SAM_CHECKSUM[15:0] can be installed into the table with a
 * single, atomic 32-bit write; in that case, the write data would contain the desired
 * SAM_INDEX[6:0] and SAM_CHECKSUM[15:0], and SAM_INDEX_WR=1.If SAM_INDEX_WR=0,
 * then the SAM_INDEX[6:0] register is written, but the checksum is not written
 * to the table.The readback value of SAM_CHECKSUM[15:0] is the contents of the
 * SAM Table at the location pointed to by SAM_INDEX[6:0]. To readback from a
 * specific table index, software should first write the desired index to
 * SAM_INDEX[6:0], and then read back the checksum from the table on SAM_CHECKSUM[15:0].
 */
/*@{*/
/*! @brief Read current value of the ZLL_SAM_TABLE_SAM_CHECKSUM field. */
#define ZLL_RD_SAM_TABLE_SAM_CHECKSUM(base) ((ZLL_SAM_TABLE_REG(base) & ZLL_SAM_TABLE_SAM_CHECKSUM_MASK) >> ZLL_SAM_TABLE_SAM_CHECKSUM_SHIFT)
#define ZLL_BRD_SAM_TABLE_SAM_CHECKSUM(base) (BME_UBFX32(&ZLL_SAM_TABLE_REG(base), ZLL_SAM_TABLE_SAM_CHECKSUM_SHIFT, ZLL_SAM_TABLE_SAM_CHECKSUM_WIDTH))

/*! @brief Set the SAM_CHECKSUM field to a new value. */
#define ZLL_WR_SAM_TABLE_SAM_CHECKSUM(base, value) (ZLL_RMW_SAM_TABLE(base, ZLL_SAM_TABLE_SAM_CHECKSUM_MASK, ZLL_SAM_TABLE_SAM_CHECKSUM(value)))
#define ZLL_BWR_SAM_TABLE_SAM_CHECKSUM(base, value) (BME_BFI32(&ZLL_SAM_TABLE_REG(base), ((uint32_t)(value) << ZLL_SAM_TABLE_SAM_CHECKSUM_SHIFT), ZLL_SAM_TABLE_SAM_CHECKSUM_SHIFT, ZLL_SAM_TABLE_SAM_CHECKSUM_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SAM_TABLE, field SAM_INDEX_INV[24] (WO)
 */
/*@{*/
/*! @brief Set the SAM_INDEX_INV field to a new value. */
#define ZLL_WR_SAM_TABLE_SAM_INDEX_INV(base, value) (ZLL_RMW_SAM_TABLE(base, ZLL_SAM_TABLE_SAM_INDEX_INV_MASK, ZLL_SAM_TABLE_SAM_INDEX_INV(value)))
#define ZLL_BWR_SAM_TABLE_SAM_INDEX_INV(base, value) (ZLL_WR_SAM_TABLE_SAM_INDEX_INV(base, value))
/*@}*/

/*!
 * @name Register ZLL_SAM_TABLE, field SAM_INDEX_EN[25] (WO)
 */
/*@{*/
/*! @brief Set the SAM_INDEX_EN field to a new value. */
#define ZLL_WR_SAM_TABLE_SAM_INDEX_EN(base, value) (ZLL_RMW_SAM_TABLE(base, ZLL_SAM_TABLE_SAM_INDEX_EN_MASK, ZLL_SAM_TABLE_SAM_INDEX_EN(value)))
#define ZLL_BWR_SAM_TABLE_SAM_INDEX_EN(base, value) (ZLL_WR_SAM_TABLE_SAM_INDEX_EN(base, value))
/*@}*/

/*!
 * @name Register ZLL_SAM_TABLE, field ACK_FRM_PND[26] (RW)
 *
 * Software can take manual control of the FramePending field of the Frame
 * Control Field of the next automatic TX acknowledge packet, by setting
 * ACK_FRM_PND_CTRL=1; in that case FramePending will track the state of this bit. The
 * FramePending field also tracks this bit if Source Address Management is comletely
 * disabled, i.e., SAP0_EN=SAA0_EN=SAP1_EN=SAA1_EN=0 Otherwise, the FramePending
 * field is determined by Source Address Management (SAM) hardware.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SAM_TABLE_ACK_FRM_PND field. */
#define ZLL_RD_SAM_TABLE_ACK_FRM_PND(base) ((ZLL_SAM_TABLE_REG(base) & ZLL_SAM_TABLE_ACK_FRM_PND_MASK) >> ZLL_SAM_TABLE_ACK_FRM_PND_SHIFT)
#define ZLL_BRD_SAM_TABLE_ACK_FRM_PND(base) (BME_UBFX32(&ZLL_SAM_TABLE_REG(base), ZLL_SAM_TABLE_ACK_FRM_PND_SHIFT, ZLL_SAM_TABLE_ACK_FRM_PND_WIDTH))

/*! @brief Set the ACK_FRM_PND field to a new value. */
#define ZLL_WR_SAM_TABLE_ACK_FRM_PND(base, value) (ZLL_RMW_SAM_TABLE(base, ZLL_SAM_TABLE_ACK_FRM_PND_MASK, ZLL_SAM_TABLE_ACK_FRM_PND(value)))
#define ZLL_BWR_SAM_TABLE_ACK_FRM_PND(base, value) (BME_BFI32(&ZLL_SAM_TABLE_REG(base), ((uint32_t)(value) << ZLL_SAM_TABLE_ACK_FRM_PND_SHIFT), ZLL_SAM_TABLE_ACK_FRM_PND_SHIFT, ZLL_SAM_TABLE_ACK_FRM_PND_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SAM_TABLE, field ACK_FRM_PND_CTRL[27] (RW)
 *
 * Values:
 * - 0b0 - the FramePending field of the Frame Control Field of the next
 *     automatic TX acknowledge packet is determined by hardware
 * - 0b1 - the FramePending field of the Frame Control Field of the next
 *     automatic TX acknowledge packet tracks ACK_FRM_PEND
 */
/*@{*/
/*! @brief Read current value of the ZLL_SAM_TABLE_ACK_FRM_PND_CTRL field. */
#define ZLL_RD_SAM_TABLE_ACK_FRM_PND_CTRL(base) ((ZLL_SAM_TABLE_REG(base) & ZLL_SAM_TABLE_ACK_FRM_PND_CTRL_MASK) >> ZLL_SAM_TABLE_ACK_FRM_PND_CTRL_SHIFT)
#define ZLL_BRD_SAM_TABLE_ACK_FRM_PND_CTRL(base) (BME_UBFX32(&ZLL_SAM_TABLE_REG(base), ZLL_SAM_TABLE_ACK_FRM_PND_CTRL_SHIFT, ZLL_SAM_TABLE_ACK_FRM_PND_CTRL_WIDTH))

/*! @brief Set the ACK_FRM_PND_CTRL field to a new value. */
#define ZLL_WR_SAM_TABLE_ACK_FRM_PND_CTRL(base, value) (ZLL_RMW_SAM_TABLE(base, ZLL_SAM_TABLE_ACK_FRM_PND_CTRL_MASK, ZLL_SAM_TABLE_ACK_FRM_PND_CTRL(value)))
#define ZLL_BWR_SAM_TABLE_ACK_FRM_PND_CTRL(base, value) (BME_BFI32(&ZLL_SAM_TABLE_REG(base), ((uint32_t)(value) << ZLL_SAM_TABLE_ACK_FRM_PND_CTRL_SHIFT), ZLL_SAM_TABLE_ACK_FRM_PND_CTRL_SHIFT, ZLL_SAM_TABLE_ACK_FRM_PND_CTRL_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SAM_TABLE, field FIND_FREE_IDX[28] (WO)
 *
 * After modifying Valid bits (enabling or invalidating), write this bit to 1 to
 * force hardware to update the "First Free Index" registers to account for the
 * changed Valid bits. This hardware update process takes 4us. Software can poll
 * SAM_BUSY to determine when the table update is complete. Write-only bit.
 * Writing 0 to this bit has no effect. Readback value is indeterminate.
 */
/*@{*/
/*! @brief Set the FIND_FREE_IDX field to a new value. */
#define ZLL_WR_SAM_TABLE_FIND_FREE_IDX(base, value) (ZLL_RMW_SAM_TABLE(base, ZLL_SAM_TABLE_FIND_FREE_IDX_MASK, ZLL_SAM_TABLE_FIND_FREE_IDX(value)))
#define ZLL_BWR_SAM_TABLE_FIND_FREE_IDX(base, value) (ZLL_WR_SAM_TABLE_FIND_FREE_IDX(base, value))
/*@}*/

/*!
 * @name Register ZLL_SAM_TABLE, field INVALIDATE_ALL[29] (WO)
 *
 * Writing a 1 to this bit clears all 128 Valid bits. Invalidates the entire
 * table. Write-only bit. Writing 0 to this bit has no effect. Readback value is
 * indeterminate.
 */
/*@{*/
/*! @brief Set the INVALIDATE_ALL field to a new value. */
#define ZLL_WR_SAM_TABLE_INVALIDATE_ALL(base, value) (ZLL_RMW_SAM_TABLE(base, ZLL_SAM_TABLE_INVALIDATE_ALL_MASK, ZLL_SAM_TABLE_INVALIDATE_ALL(value)))
#define ZLL_BWR_SAM_TABLE_INVALIDATE_ALL(base, value) (ZLL_WR_SAM_TABLE_INVALIDATE_ALL(base, value))
/*@}*/

/*!
 * @name Register ZLL_SAM_TABLE, field SAM_BUSY[31] (RO)
 *
 * Hardware is in the process of updating the Source Address table, either in
 * response to a poll indication from the packet processor, or due to software
 * setting FIND_FREE_IDX=1. In the latter case, software should poll SAM_BUSY until
 * low before accessing the "First Free Index" registers. Read-only bit.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SAM_TABLE_SAM_BUSY field. */
#define ZLL_RD_SAM_TABLE_SAM_BUSY(base) ((ZLL_SAM_TABLE_REG(base) & ZLL_SAM_TABLE_SAM_BUSY_MASK) >> ZLL_SAM_TABLE_SAM_BUSY_SHIFT)
#define ZLL_BRD_SAM_TABLE_SAM_BUSY(base) (BME_UBFX32(&ZLL_SAM_TABLE_REG(base), ZLL_SAM_TABLE_SAM_BUSY_SHIFT, ZLL_SAM_TABLE_SAM_BUSY_WIDTH))
/*@}*/

