RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW20Z4/include/MKW20Z4_extension.h
/*******************************************************************************
 * ZLL_ACKDELAY - ACK DELAY
 ******************************************************************************/

/*!
 * @brief ZLL_ACKDELAY - ACK DELAY (RW)
 *
 * Reset value: 0x00000007U
 */
/*!
 * @name Constants and macros for entire ZLL_ACKDELAY register
 */
/*@{*/
#define ZLL_RD_ACKDELAY(base)    (ZLL_ACKDELAY_REG(base))
#define ZLL_WR_ACKDELAY(base, value) (ZLL_ACKDELAY_REG(base) = (value))
#define ZLL_RMW_ACKDELAY(base, mask, value) (ZLL_WR_ACKDELAY(base, (ZLL_RD_ACKDELAY(base) & ~(mask)) | (value)))
#define ZLL_SET_ACKDELAY(base, value) (BME_OR32(&ZLL_ACKDELAY_REG(base), (uint32_t)(value)))
#define ZLL_CLR_ACKDELAY(base, value) (BME_AND32(&ZLL_ACKDELAY_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_ACKDELAY(base, value) (BME_XOR32(&ZLL_ACKDELAY_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_ACKDELAY bitfields
 */

/*!
 * @name Register ZLL_ACKDELAY, field ACKDELAY[5:0] (RW)
 *
 * Provides a fine-tune adjustment of the time delay between Rx warmdown and the
 * beginning of Tx warmup for an Tx Acknowledge packet. ACKDELAY register will
 * apply to both SLOTTED and UNSLOTTED TxAck, but only to TxAck (not T sequences).
 * This is a two's complement value. The minimum permissible value is -19
 * (0x2D). Values less than -19 will lead to unexpected results. Resolution = 2us.
 * Range = +/- 62us. Max ACKDELAY = 0x1F.Min ACKDELAY = 0x2D.
 */
/*@{*/
/*! @brief Read current value of the ZLL_ACKDELAY_ACKDELAY field. */
#define ZLL_RD_ACKDELAY_ACKDELAY(base) ((ZLL_ACKDELAY_REG(base) & ZLL_ACKDELAY_ACKDELAY_MASK) >> ZLL_ACKDELAY_ACKDELAY_SHIFT)
#define ZLL_BRD_ACKDELAY_ACKDELAY(base) (BME_UBFX32(&ZLL_ACKDELAY_REG(base), ZLL_ACKDELAY_ACKDELAY_SHIFT, ZLL_ACKDELAY_ACKDELAY_WIDTH))

/*! @brief Set the ACKDELAY field to a new value. */
#define ZLL_WR_ACKDELAY_ACKDELAY(base, value) (ZLL_RMW_ACKDELAY(base, ZLL_ACKDELAY_ACKDELAY_MASK, ZLL_ACKDELAY_ACKDELAY(value)))
#define ZLL_BWR_ACKDELAY_ACKDELAY(base, value) (BME_BFI32(&ZLL_ACKDELAY_REG(base), ((uint32_t)(value) << ZLL_ACKDELAY_ACKDELAY_SHIFT), ZLL_ACKDELAY_ACKDELAY_SHIFT, ZLL_ACKDELAY_ACKDELAY_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_ACKDELAY, field TXDELAY[13:8] (RW)
 *
 * Provides a fine-tune adjustment of the time delay between post-CCA Rx
 * warm-down and the beginning of Tx warm-up for an Tx (non-Ack) packet. TXDELAY
 * register will apply in both SLOTTED and UNSLOTTED modes, but only to T sequences
 * (e.g., T, TR, and T(R) ), not TxAck operations. This is a two's complement value.
 * The minimum permissible value is -19 (0x2D). Values less than -19 will lead to
 * unexpected results. Resolution = 2us. Range = +/- 62us. Max TXDELAY =
 * 0x1F.Min TXDELAY = 0x2D.
 */
/*@{*/
/*! @brief Read current value of the ZLL_ACKDELAY_TXDELAY field. */
#define ZLL_RD_ACKDELAY_TXDELAY(base) ((ZLL_ACKDELAY_REG(base) & ZLL_ACKDELAY_TXDELAY_MASK) >> ZLL_ACKDELAY_TXDELAY_SHIFT)
#define ZLL_BRD_ACKDELAY_TXDELAY(base) (BME_UBFX32(&ZLL_ACKDELAY_REG(base), ZLL_ACKDELAY_TXDELAY_SHIFT, ZLL_ACKDELAY_TXDELAY_WIDTH))

/*! @brief Set the TXDELAY field to a new value. */
#define ZLL_WR_ACKDELAY_TXDELAY(base, value) (ZLL_RMW_ACKDELAY(base, ZLL_ACKDELAY_TXDELAY_MASK, ZLL_ACKDELAY_TXDELAY(value)))
#define ZLL_BWR_ACKDELAY_TXDELAY(base, value) (BME_BFI32(&ZLL_ACKDELAY_REG(base), ((uint32_t)(value) << ZLL_ACKDELAY_TXDELAY_SHIFT), ZLL_ACKDELAY_TXDELAY_SHIFT, ZLL_ACKDELAY_TXDELAY_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_FILTERFAIL_CODE - FILTER FAIL CODE
 ******************************************************************************/

/*!
 * @brief ZLL_FILTERFAIL_CODE - FILTER FAIL CODE (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ZLL_FILTERFAIL_CODE register
 */
/*@{*/
#define ZLL_RD_FILTERFAIL_CODE(base) (ZLL_FILTERFAIL_CODE_REG(base))
#define ZLL_WR_FILTERFAIL_CODE(base, value) (ZLL_FILTERFAIL_CODE_REG(base) = (value))
#define ZLL_RMW_FILTERFAIL_CODE(base, mask, value) (ZLL_WR_FILTERFAIL_CODE(base, (ZLL_RD_FILTERFAIL_CODE(base) & ~(mask)) | (value)))
#define ZLL_SET_FILTERFAIL_CODE(base, value) (BME_OR32(&ZLL_FILTERFAIL_CODE_REG(base), (uint32_t)(value)))
#define ZLL_CLR_FILTERFAIL_CODE(base, value) (BME_AND32(&ZLL_FILTERFAIL_CODE_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_FILTERFAIL_CODE(base, value) (BME_XOR32(&ZLL_FILTERFAIL_CODE_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_FILTERFAIL_CODE bitfields
 */

/*!
 * @name Register ZLL_FILTERFAIL_CODE, field FILTERFAIL_CODE[9:0] (RO)
 *
 * Code inidicating what condition, or conditions, caused the Packet Processor
 * to reject the just-received packet. The bits of FILTERFAIL_CODE indicate the
 * reason for packet rejection according to the table below: FILTERFAIL CODE BIT
 * REASON FOR FILTERFAIL [0] Fails Stage 1 Frame Length Checking (FL < 5 or FL >
 * MAXFRAMELENGTH) Note: FL < 3 will not generate an SFD, so this bit will not be
 * set [1] Fails Stage 1 Section 7.2.1.1.6 or Section 7.2.1.1.8 Checking
 * (DST_ADDR_MODE or SRC_ADDR_MODE = 1) [2] Fails Stage 1 Section 7.2.1.1.5 Checking
 * (Illegal PAN_ID_COMPRESSION Usage) [3] Fails Stage 1 Frame Version Checking [4]
 * Fails Stage 2 Auto-RxAck Checking (Illegal Ack Frame Format in Sequence TR) [5]
 * Fails Stage 2 Frame Type Checking (Incorrect Frame Filter Bit setting) [6]
 * Fails Stage 2 Frame Length Checking (Illegal Beacon, Data, or Cmd FL) [7] Fails
 * Stage 2 Addressing Mode Checking (Illegal Addressing Mode for Beacon, Data, OR
 * Cmd) [8] Fails Stage 2 Sequence Number Matching (Sequence TR Only) [9] Fails
 * Stage 2 PAN ID or Address Checking (Beacon, Data, or Cmd)
 */
/*@{*/
/*! @brief Read current value of the ZLL_FILTERFAIL_CODE_FILTERFAIL_CODE field. */
#define ZLL_RD_FILTERFAIL_CODE_FILTERFAIL_CODE(base) ((ZLL_FILTERFAIL_CODE_REG(base) & ZLL_FILTERFAIL_CODE_FILTERFAIL_CODE_MASK) >> ZLL_FILTERFAIL_CODE_FILTERFAIL_CODE_SHIFT)
#define ZLL_BRD_FILTERFAIL_CODE_FILTERFAIL_CODE(base) (BME_UBFX32(&ZLL_FILTERFAIL_CODE_REG(base), ZLL_FILTERFAIL_CODE_FILTERFAIL_CODE_SHIFT, ZLL_FILTERFAIL_CODE_FILTERFAIL_CODE_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_FILTERFAIL_CODE, field FILTERFAIL_PAN_SEL[15] (RW)
 *
 * Values:
 * - 0b0 - FILTERFAIL_CODE[9:0] will report the FILTERFAIL status of PAN0
 * - 0b1 - FILTERFAIL_CODE[9:0] will report the FILTERFAIL status of PAN1
 */
/*@{*/
/*! @brief Read current value of the ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL field. */
#define ZLL_RD_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL(base) ((ZLL_FILTERFAIL_CODE_REG(base) & ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL_MASK) >> ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL_SHIFT)
#define ZLL_BRD_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL(base) (BME_UBFX32(&ZLL_FILTERFAIL_CODE_REG(base), ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL_SHIFT, ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL_WIDTH))

/*! @brief Set the FILTERFAIL_PAN_SEL field to a new value. */
#define ZLL_WR_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL(base, value) (ZLL_RMW_FILTERFAIL_CODE(base, ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL_MASK, ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL(value)))
#define ZLL_BWR_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL(base, value) (BME_BFI32(&ZLL_FILTERFAIL_CODE_REG(base), ((uint32_t)(value) << ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL_SHIFT), ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL_SHIFT, ZLL_FILTERFAIL_CODE_FILTERFAIL_PAN_SEL_WIDTH))
/*@}*/

