RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW20Z4/include/MKW20Z4_extension.h
/*******************************************************************************
 * ZLL_TMR_PRESCALE - TIMER PRESCALER
 ******************************************************************************/

/*!
 * @brief ZLL_TMR_PRESCALE - TIMER PRESCALER (RW)
 *
 * Reset value: 0x00000003U
 *
 * Timer Prescaler
 */
/*!
 * @name Constants and macros for entire ZLL_TMR_PRESCALE register
 */
/*@{*/
#define ZLL_RD_TMR_PRESCALE(base) (ZLL_TMR_PRESCALE_REG(base))
#define ZLL_WR_TMR_PRESCALE(base, value) (ZLL_TMR_PRESCALE_REG(base) = (value))
#define ZLL_RMW_TMR_PRESCALE(base, mask, value) (ZLL_WR_TMR_PRESCALE(base, (ZLL_RD_TMR_PRESCALE(base) & ~(mask)) | (value)))
#define ZLL_SET_TMR_PRESCALE(base, value) (BME_OR32(&ZLL_TMR_PRESCALE_REG(base), (uint32_t)(value)))
#define ZLL_CLR_TMR_PRESCALE(base, value) (BME_AND32(&ZLL_TMR_PRESCALE_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_TMR_PRESCALE(base, value) (BME_XOR32(&ZLL_TMR_PRESCALE_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_TMR_PRESCALE bitfields
 */

/*!
 * @name Register ZLL_TMR_PRESCALE, field TMR_PRESCALE[2:0] (RW)
 *
 * Timer Prescaler. Establishes the Event Timer clock rate, (maximum timer
 * duration)
 *
 * Values:
 * - 0b000 - Reserved
 * - 0b001 - Reserved
 * - 0b010 - 500kHz (33.55 S)
 * - 0b011 - 250kHz (67.11 S) -- default
 * - 0b100 - 125kHz (134.22 S)
 * - 0b101 - 62.5kHz (268.44 S)
 * - 0b110 - 31.25kHz (536.87 S)
 * - 0b111 - 15.625kHz (1073.74 S)
 */
/*@{*/
/*! @brief Read current value of the ZLL_TMR_PRESCALE_TMR_PRESCALE field. */
#define ZLL_RD_TMR_PRESCALE_TMR_PRESCALE(base) ((ZLL_TMR_PRESCALE_REG(base) & ZLL_TMR_PRESCALE_TMR_PRESCALE_MASK) >> ZLL_TMR_PRESCALE_TMR_PRESCALE_SHIFT)
#define ZLL_BRD_TMR_PRESCALE_TMR_PRESCALE(base) (BME_UBFX32(&ZLL_TMR_PRESCALE_REG(base), ZLL_TMR_PRESCALE_TMR_PRESCALE_SHIFT, ZLL_TMR_PRESCALE_TMR_PRESCALE_WIDTH))

/*! @brief Set the TMR_PRESCALE field to a new value. */
#define ZLL_WR_TMR_PRESCALE_TMR_PRESCALE(base, value) (ZLL_RMW_TMR_PRESCALE(base, ZLL_TMR_PRESCALE_TMR_PRESCALE_MASK, ZLL_TMR_PRESCALE_TMR_PRESCALE(value)))
#define ZLL_BWR_TMR_PRESCALE_TMR_PRESCALE(base, value) (BME_BFI32(&ZLL_TMR_PRESCALE_REG(base), ((uint32_t)(value) << ZLL_TMR_PRESCALE_TMR_PRESCALE_SHIFT), ZLL_TMR_PRESCALE_TMR_PRESCALE_SHIFT, ZLL_TMR_PRESCALE_TMR_PRESCALE_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_LENIENCY_LSB - LENIENCY LSB
 ******************************************************************************/

/*!
 * @brief ZLL_LENIENCY_LSB - LENIENCY LSB (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Packet Processor performs filtering on all received packets, in order to
 * determine whether the packet is intended for the device. The packet filtering
 * is based on rules. In case any of the packet filtering rules need to be
 * overriden, a 40-bit "leniency register" has been provided. When the leniency
 * register is programmed to its default value (0), all hardware packet filtering rules
 * are in effect, and if an incoming packet violates any rule, a "Filter Fail"
 * will occur (packet will be rejected). When a given leniency register bit is
 * asserted, the packet filtering rule assigned to that bit will not be in effect,
 * and if any incoming packet violates that rule (but no other rules), then a
 * "Filter Fail" will not occur, the packet will not be rejected, the packet will be
 * treated as "intended for the device", and software will be notified of the
 * incoming packet. The table below shows the assignment of leniency bits to packet
 * filtering rules.
 */
/*!
 * @name Constants and macros for entire ZLL_LENIENCY_LSB register
 */
/*@{*/
#define ZLL_RD_LENIENCY_LSB(base) (ZLL_LENIENCY_LSB_REG(base))
#define ZLL_WR_LENIENCY_LSB(base, value) (ZLL_LENIENCY_LSB_REG(base) = (value))
#define ZLL_RMW_LENIENCY_LSB(base, mask, value) (ZLL_WR_LENIENCY_LSB(base, (ZLL_RD_LENIENCY_LSB(base) & ~(mask)) | (value)))
#define ZLL_SET_LENIENCY_LSB(base, value) (BME_OR32(&ZLL_LENIENCY_LSB_REG(base), (uint32_t)(value)))
#define ZLL_CLR_LENIENCY_LSB(base, value) (BME_AND32(&ZLL_LENIENCY_LSB_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_LENIENCY_LSB(base, value) (BME_XOR32(&ZLL_LENIENCY_LSB_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * ZLL_LENIENCY_MSB - LENIENCY MSB
 ******************************************************************************/

/*!
 * @brief ZLL_LENIENCY_MSB - LENIENCY MSB (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Packet Processor performs filtering on all received packets, in order to
 * determine whether the packet is intended for the device. The packet filtering
 * is based on rules. In case any of the packet filtering rules need to be
 * overriden, a 40-bit "leniency register" has been provided. When the leniency
 * register is programmed to its default value (0), all hardware packet filtering rules
 * are in effect, and if an incoming packet violates any rule, a "Filter Fail"
 * will occur (packet will be rejected). When a given leniency register bit is
 * asserted, the packet filtering rule assigned to that bit will not be in effect,
 * and if any incoming packet violates that rule (but no other rules), then a
 * "Filter Fail" will not occur, the packet will not be rejected, the packet will be
 * treated as "intended for the device", and software will be notified of the
 * incoming packet. The table below shows the assignment of leniency bits to packet
 * filtering rules.
 */
/*!
 * @name Constants and macros for entire ZLL_LENIENCY_MSB register
 */
/*@{*/
#define ZLL_RD_LENIENCY_MSB(base) (ZLL_LENIENCY_MSB_REG(base))
#define ZLL_WR_LENIENCY_MSB(base, value) (ZLL_LENIENCY_MSB_REG(base) = (value))
#define ZLL_RMW_LENIENCY_MSB(base, mask, value) (ZLL_WR_LENIENCY_MSB(base, (ZLL_RD_LENIENCY_MSB(base) & ~(mask)) | (value)))
#define ZLL_SET_LENIENCY_MSB(base, value) (BME_OR32(&ZLL_LENIENCY_MSB_REG(base), (uint32_t)(value)))
#define ZLL_CLR_LENIENCY_MSB(base, value) (BME_AND32(&ZLL_LENIENCY_MSB_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_LENIENCY_MSB(base, value) (BME_XOR32(&ZLL_LENIENCY_MSB_REG(base), (uint32_t)(value)))
/*@}*/

